Autodesk.Revit.DB.ElementClassFilter.GetElementClass
The class for the filter.
Returns:
The class.
Since:
2011

Autodesk.Revit.DB.ElementClassFilter.#ctor(System.Type,System.Boolean)
Constructs a new instance of a filter to match elements by class, with the option to match all elements which are not of the given class.
type:
The type to match.
inverted:
True if the filter should match all elements which are not of the given class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element class that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementClassFilter.#ctor(System.Type)
Constructs a new instance of a filter to match elements by class.
type:
The type to match.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input type is not a subclass of Element.
-or-
The input type is of an element class that exists in the API, but not in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.ElementClassFilter
A filter used to match elements by their class.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
This filter will match elements whose class is an exact match to the input class,
or elements whose class is derived from the input class.There is a small subset of Element subclasses in the API which are not supported
by this filter.  These types exist in the API, but not in Revit's native object model,
which means that this filter doesn't support them.  In order to use a class filter to
find elements of these types, it is necessary to use a higher level class and then
process the results further to find elements matching only the subtype.  The following
types are affected by this restriction:
Subclasses of Autodesk.Revit.DB.MaterialSubclasses of Autodesk.Revit.DB.CurveElementSubclasses of Autodesk.Revit.DB.ConnectorElementSubclasses of Autodesk.Revit.DB.HostedSweepAutodesk.Revit.DB.Architecture.RoomAutodesk.Revit.DB.Mechanical.SpaceAutodesk.Revit.DB.AreaAutodesk.Revit.DB.Architecture.RoomTagAutodesk.Revit.DB.Mechanical.SpaceTagAutodesk.Revit.DB.AreaTagAutodesk.Revit.DB.CombinableElementAutodesk.Revit.DB.MullionAutodesk.Revit.DB.PanelAutodesk.Revit.DB.AnnotationSymbolAutodesk.Revit.DB.Structure.AreaReinforcementTypeAutodesk.Revit.DB.Structure.PathReinforcementTypeAutodesk.Revit.DB.AnnotationSymbolTypeAutodesk.Revit.DB.Architecture.RoomTagTypeAutodesk.Revit.DB.Mechanical.SpaceTagTypeAutodesk.Revit.DB.AreaTagTypeAutodesk.Revit.DB.Structure.TrussType
Since:
2011